{"class_name": "Model", "keras_version": "1.1.0", "config": {"layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, null, 161], "input_dtype": "float32", "sparse": false, "name": "acoustic_input"}, "inbound_nodes": [], "name": "acoustic_input"}, {"class_name": "Convolution1D", "config": {"W_constraint": null, "b_constraint": null, "name": "conv1d", "activity_regularizer": null, "trainable": true, "filter_length": 11, "init": "glorot_uniform", "bias": true, "nb_filter": 1000, "input_dim": null, "subsample_length": 2, "border_mode": "valid", "b_regularizer": null, "W_regularizer": null, "activation": "relu", "input_length": null}, "inbound_nodes": [[["acoustic_input", 0, 0]]], "name": "conv1d"}, {"class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "name": "bn_conv_1d", "epsilon": 1e-05, "trainable": true, "mode": 2, "beta_regularizer": null, "momentum": 0.99, "axis": -1}, "inbound_nodes": [[["conv1d", 0, 0]]], "name": "bn_conv_1d"}, {"class_name": "GRU", "config": {"U_regularizer": null, "name": "rnn_1", "inner_activation": "hard_sigmoid", "go_backwards": false, "output_dim": 1000, "trainable": true, "unroll": false, "consume_less": "cpu", "stateful": false, "init": "glorot_uniform", "inner_init": "orthogonal", "dropout_U": 0.0, "dropout_W": 0.0, "input_dim": 1000, "return_sequences": true, "b_regularizer": null, "W_regularizer": null, "activation": "relu", "input_length": null}, "inbound_nodes": [[["bn_conv_1d", 0, 0]]], "name": "rnn_1"}, {"class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "name": "bn_rnn_1", "epsilon": 1e-05, "trainable": true, "mode": 2, "beta_regularizer": null, "momentum": 0.99, "axis": -1}, "inbound_nodes": [[["rnn_1", 0, 0]]], "name": "bn_rnn_1"}, {"class_name": "GRU", "config": {"U_regularizer": null, "name": "rnn_2", "inner_activation": "hard_sigmoid", "go_backwards": false, "output_dim": 1000, "trainable": true, "unroll": false, "consume_less": "cpu", "stateful": false, "init": "glorot_uniform", "inner_init": "orthogonal", "dropout_U": 0.0, "dropout_W": 0.0, "input_dim": 1000, "return_sequences": true, "b_regularizer": null, "W_regularizer": null, "activation": "relu", "input_length": null}, "inbound_nodes": [[["bn_rnn_1", 0, 0]]], "name": "rnn_2"}, {"class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "name": "bn_rnn_2", "epsilon": 1e-05, "trainable": true, "mode": 2, "beta_regularizer": null, "momentum": 0.99, "axis": -1}, "inbound_nodes": [[["rnn_2", 0, 0]]], "name": "bn_rnn_2"}, {"class_name": "GRU", "config": {"U_regularizer": null, "name": "rnn_3", "inner_activation": "hard_sigmoid", "go_backwards": false, "output_dim": 1000, "trainable": true, "unroll": false, "consume_less": "cpu", "stateful": false, "init": "glorot_uniform", "inner_init": "orthogonal", "dropout_U": 0.0, "dropout_W": 0.0, "input_dim": 1000, "return_sequences": true, "b_regularizer": null, "W_regularizer": null, "activation": "relu", "input_length": null}, "inbound_nodes": [[["bn_rnn_2", 0, 0]]], "name": "rnn_3"}, {"class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "name": "bn_rnn_3", "epsilon": 1e-05, "trainable": true, "mode": 2, "beta_regularizer": null, "momentum": 0.99, "axis": -1}, "inbound_nodes": [[["rnn_3", 0, 0]]], "name": "bn_rnn_3"}, {"class_name": "TimeDistributed", "config": {"layer": {"class_name": "Dense", "config": {"W_constraint": null, "b_constraint": null, "name": "dense", "activity_regularizer": null, "trainable": true, "init": "glorot_uniform", "bias": true, "input_dim": null, "b_regularizer": null, "W_regularizer": null, "activation": "linear", "output_dim": 29}}, "trainable": true, "name": "timedistributed_1"}, "inbound_nodes": [[["bn_rnn_3", 0, 0]]], "name": "timedistributed_1"}], "input_layers": [["acoustic_input", 0, 0]], "output_layers": [["timedistributed_1", 0, 0]], "name": "model_1"}}